{
    "en": {
        "pageTitle": "ID Finder",
        "title": "Recover My Login Credentials",
        "subTitle": "Please enter your Email Address where your credentials are to be sent. Note: this service will only email credentials to Active Learners.",
        "membEmail": "Email Address",
        "search": "Search",
        "contactUs": "Contact us",
        "emailSubject": "Your Credentials",
        "emailBody1": "Customer Id ",
        "emailBody2": "Password ",
        "getId": "We are calling up the Credentials Service. This should just take a minute.",
        "noEmail": "Please enter a valid email.",
        "doneEmail": "Your credentials have been emailed.",
        "failEmail": "The Email Service was unable to email your credentials. Please contact support.",
        "doneGetId": "That Email Address is either not unique, not on file or is not associated with an active learner.",
        "failGetId": "We were unable to run the Credentials Service. Please contact support.",
        "failGetLanguagePack": "We were unable to load the language file for this service. Please contact support."
    },
    "fr": {
        "pageTitle": "Chercheur d'identification",
        "title": "Récupérer mes informations de connexion",
        "subTitle": "Veuillez entrer votre adresse courriel où vos informations d'identification doivent être envoyés. Remarque: Ce service enverra des informations d'identification à des apprenants actifs seulement.",
        "membEmail": "Adresse courriel",
        "search": "Rechercher",
        "contactUs": "Communiquez avec nous",
        "emailSubject": "Vos informations d'identification",
        "emailBody1": "Code de client",
        "emailBody2": "Mot de passe",
        "getId": "Nous appelons le service de chercheur d'identification. Cela devrait prendre seulement quelques instants.",
        "noEmail": "Veuillez entrer une adresse courriel valide.",
        "doneEmail": "Vos informations d'identification ont été envoyé par courriel.",
        "failEmail": "Le service de courrier électronique n'a pas pu vous envoyer vos informations d'identification. Veuillez en avertir l'appui.",
        "doneGetId": "L’adresse courriel n’est pas unique, jamais enregistré ou n’est pas associé à un apprenant actif.",
        "failGetId": "Nous avons été incapables d'exécuter le service qui récupère vos informations d'identification. Veuillez en avertir l'appui.",
        "failGetLanguagePack": "Nous n'avons pu charger le fichier de langue pour cette page. Veuillez en avertir l'appui."
    },
    "es": {
        "pageTitle": "ID Finder",
        "title": "Recuperar mi Id de estudiante (contraseña)",
        "subTitle": "Por favor ingrese su Id de cliente y la dirección de correo electrónico que se encuentra en el perfil del alumno. Su identificación de estudiante (Password) se enviará a esa dirección.",
        "membEmail": "Dirección de correo electrónico:",
        "search": "Búsqueda de",
        "contactUs": "Contact us",
        "emailSubject": "Su identificación de estudiante (contraseña)",
        "emailBody1": "ID alumno (contraseña)",
        "emailBody2": "ID alumno (contraseña)",
        "getId": "Estamos llamando al servicio de ID Finder. Esto sólo debe tomar unos momentos.",
        "noEmail": "Please enter a valid email.",
        "doneEmail": "Su identificación de estudiante (contraseña) es ser enviada a usted ahora.",
        "failEmail": "El servicio de correo electrónico no pudo enviarle por correo electrónico el ID del alumno.",
        "doneGetId": "Dirección de correo electrónico es no exclusivo, no en archivo o no está asociado a un aprendiz activo.",
        "failEmail": "Fuimos incapaces de ejecutar el servicio que recupera su ID de estudiante. Alerta por favor ayuda.",
        "failGetLanguagePack": "No pudimos cargar el paquete de idioma para esta página. Alerta por favor ayuda."
    },
    "pt": {
        "pageTitle": "ID Finder",
        "title": "Recuperar minha Id do aluno (senha)",
        "subTitle": "Por favor digite seu Id de cliente e o endereço de E-mail que está no seu perfil de aluno. Seu Id de aluno (senha) será enviado para esse endereço.",
        "membEmail1": "Endereço de e-mail:",
        "search": "Pesquisa",
        "contactUs": "Contact us",
        "emailSubject": "Seu ID de aluno (senha)",
        "emailBody1": "Aluno ID (senha)",
        "emailBody2": "Aluno ID (senha)",
        "noEmail": "Please enter a valid email.",
        "getId": "Estamos chamando o serviço de localizador de ID. Isto só deve demorar alguns momentos.",
        "doneEmail": "Seu ID de aluno (senha) está sendo enviado a você agora.",
        "failEmail": "O serviço de Email não pôde enviar correio electrónico a ID do aluno.",
        "doneGetId": "Que endereço de e-mail é ou não exclusivo, não em arquivo ou não está associada com um aprendiz ativo.",
        "failEmail": "Fomos capazes de executar o serviço que recupera seu ID de aluno. Por favor, alerte o suporte.",
        "failGetLanguagePack": "Fomos incapazes de carregar o pacote de idiomas para esta página. Por favor, alerte o suporte."
    }
}
